Рабочая.Задачи2/src/InformationRegisters/ЦБР_УточненияПоЗадачамЗаданиям/ЦБР_УточненияПоЗадачамЗаданиям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_УточненияПоЗадачамЗаданиям</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОтвета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтветаНаЗапросФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОтветаНаЗапрос</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДатаОтветаНаЗапрос</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/InformationRegisters/ЦБР_УточненияПоЗадачамЗаданиям/Forms/ФормаЧата/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Задание = Параметры.Задание;
	УстановитьВидимостьЭлементов();
	ЧатHTMLОбновить();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("Обновление", 3);
	//Элементы.ЧатHTML.Документ.scrollingElement.scrollTop = Элементы.ЧатHTML.Документ.scrollingElement.scrollHeight + 9999999;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ЧатHTMLДокументСформирован(Элемент)
	Элементы.ЧатHTML.Документ.scrollingElement.scrollTop = Элементы.ЧатHTML.Документ.scrollingElement.scrollHeight
		+ 9999999;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДатаОтветаНаЗапрос(Команда)
	
	Если ЗначениеЗаполнено(ДатаОтветаНаЗапрос) Тогда
		Возврат;
	КонецЕсли;
	Подсказка = "Когда?";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДатаОтветаНаЗапрос", ЭтотОбъект); 
	//@skip-check use-non-recommended-method
	ПоказатьВводДаты(Оповещение, ТекущаяДата(), Подсказка, ЧастиДаты.Дата);

КонецПроцедуры

&НаКлиенте
Асинх Процедура Отменить(Команда)

	Результат = Ждать ВопросАсинх("Отменить Запрос информации?",  РежимДиалогаВопрос.ДаНет);
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ОтменитьНаСервере() Тогда
//		Если ЕстьЗапросыИнформацииВЭтойЗадаче() Тогда
//			УстановитьВидимостьЭлементов();
//			ЧатHTMLОбновить();
//		Иначе
			Закрыть();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОтменитьНаСервере()
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Заявитель,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Ответчик,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Отменено,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.ТекстЗапроса,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.ТекстОтвета,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.ЦБР_УточненияПоЗадачамЗаданиям.СрезПоследних(, Задание = &Задание) КАК
	|		ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних";

	Запрос.УстановитьПараметр("Задание", Задание);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	НаборЗаписей = РегистрыСведений.ЦБР_УточненияПоЗадачамЗаданиям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(Задание);
	НаборЗаписей.Отбор.Ответчик.Установить(Выборка.Ответчик);
	НаборЗаписей.Отбор.Заявитель.Установить(Выборка.Заявитель);	
	НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
	НаборЗаписей.Прочитать();
	НаборЗаписей[0].Отменено = Истина;
	НаборЗаписей.Записать();
	
	Если ТипЗнч(Задание) = Тип("ДокументСсылка.ЦБР_Задача") Тогда
		Попытка             
			
			//ЦБР_ЗадачиЗаданияВызовСервера.ПоменятьСтатусЗадачи(Задание);
			ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусыЗадачи(Задание);  
			
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации("Отмена запроса информации по задаче", УровеньЖурналаРегистрации.Ошибка, ?(ТипЗнч(
				Задание) = Тип("ДокументСсылка.ЦБР_Задание"), Метаданные.Документы.ЦБР_Задание,
				Метаданные.Документы.ЦБР_Задача), Задание, ОписаниеОшибки());
			ОбщегоНазначения.СообщитьПользователю("Не удалось отправить сообщение." + Символы.ПС
				+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) + Символы.ПС
				+ "Подробности см. в журнале регистрации");
			ВызватьИсключение;
//			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Получатели = Новый Массив;
	Получатели.Добавить(НаборЗаписей[0].Ответчик);
	ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Задание, "ОтменаЗапросаИнформации", Получатели, НаборЗаписей[0].ТекстЗапроса);

	ЗафиксироватьТранзакцию();
	Возврат Истина;

КонецФункции

//@skip-check module-unused-method
&НаКлиенте
Процедура Отправить(Команда)

	Если СокрЛП(Комментарий) <> "" Тогда
		ОтправитьНаСервере();
		Комментарий = ""; 
		Закрыть()
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()

	НачатьТранзакцию();
	Попытка

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Заявитель,
		|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Ответчик,
		|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Отменено,
		|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.ТекстЗапроса,
		|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.ТекстОтвета,
		|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.ЦБР_УточненияПоЗадачамЗаданиям.СрезПоследних(, Задание = &Задание
		|	И НЕ Отменено) КАК ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних";

		Запрос.УстановитьПараметр("Задание", Задание);

		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		НаборЗаписей = РегистрыСведений.ЦБР_УточненияПоЗадачамЗаданиям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Задание.Установить(Задание);
		НаборЗаписей.Отбор.Ответчик.Установить(Выборка.Ответчик);
		НаборЗаписей.Отбор.Заявитель.Установить(Выборка.Заявитель);
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Прочитать();
		НаборЗаписей[0].ТекстОтвета = Комментарий;
		НаборЗаписей[0].ДатаОтветаНаЗапросФакт = ТекущаяДатаСеанса();
		НаборЗаписей.Записать();

		Получатели = Новый Массив;
		Получатели.Добавить(НаборЗаписей[0].Заявитель);
		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Задание, "ОтветНаЗапрос", Получатели, Комментарий);
		ЧатHTMLОбновить();

		Если ТипЗнч(Задание) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
			//ЦБР_ЗадачиЗаданияВызовСервера.ПоменятьСтатусЗадания(Задание.Задача, Перечисления.ЦБР_Состояние.Приостановлен);  
			//ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусСтруктурыЗадания(Задание.СсылкаНаЗадачу, Перечисления.ЦБР_Состояние.Приостановлен);  
			ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусыЗадачи(Задание.СсылкаНаЗадачу, Истина);  
		Иначе
			//ЦБР_ЗадачиЗаданияВызовСервера.ПоменятьСтатусЗадачи(Задание);  
			ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусыЗадачи(Задание, Истина);  
		КонецЕсли;

	Исключение
		ЗаписьЖурналаРегистрации("Ответ на запрос информации", УровеньЖурналаРегистрации.Ошибка, ?(ТипЗнч(Задание)
			= Тип("ДокументСсылка.ЦБР_Задание"), Метаданные.Документы.ЦБР_Задание, Метаданные.Справочники.ЦБР_Задача),
			Задание, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	ЗафиксироватьТранзакцию();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЕстьЗапросыИнформацииВЭтойЗадаче()
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Заявитель,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Ответчик,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Отменено,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.ТекстЗапроса,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.ТекстОтвета
	|ИЗ
	|	РегистрСведений.ЦБР_УточненияПоЗадачамЗаданиям.СрезПоследних(, Задание = &Задание
	|	И НЕ Отменено) КАК ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних";

	Запрос.УстановитьПараметр("Задание", Задание);

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьДатуВЗапросИнформации(ДатаОтвета, Комментарий, Задание)
	
	Получатель = Пользователи.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Задание,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Заявитель,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Ответчик,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.ЦБР_УточненияПоЗадачамЗаданиям.СрезПоследних(, Задание = &Задание
	|	И Ответчик = &Ответчик И НЕ Отменено) КАК ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних";

	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("Ответчик", Получатель);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();
	
	НаборЗаписей = РегистрыСведений.ЦБР_УточненияПоЗадачамЗаданиям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(Задание);
	НаборЗаписей.Отбор.Ответчик.Установить(Получатель);
	НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей[0].ДатаОтветаНаЗапрос = ДатаОтвета;
	НаборЗаписей[0].КомментарийДатаОтветаНаЗапрос = Комментарий;
	
	НаборЗаписей.Записать();
	 
	Получатели = Новый Массив;
	Получатели.Добавить(ВыборкаДетальныеЗаписи.Заявитель);
	КомментарийОбсуждения = Формат(ДатаОтвета,"ДЛФ=D;") + ": " + Комментарий;
	ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Задание, "ДатаОтветаНаЗапрос", Получатели, КомментарийОбсуждения);
  
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатаОтветаНаЗапрос(Ответ, Параметры) Экспорт
	
	Если НЕ Ответ = Неопределено Тогда 
		СтруктураОтвета = Новый Структура("ДатаОтвета", Ответ);		
		Подсказка = "Комментарий:";
		Оповещение = Новый ОписаниеОповещения("ПослеВводаКомментарияДатыОтветаНаЗапрос", ЭтотОбъект, СтруктураОтвета);
		ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина); 
	КонецЕсли; 
	
КонецПроцедуры    

&НаКлиенте
Процедура ПослеВводаКомментарияДатыОтветаНаЗапрос(Ответ, Параметры) Экспорт

	ДатаОбратнойСвязи = Параметры.ДатаОтвета;  
	
	СтрокаОтвета = "";	
	Если НЕ Ответ = Неопределено Тогда 
		СтрокаОтвета = Ответ;		
		ЗаписатьДатувЗапросИнформации(ДатаОбратнойСвязи, СтрокаОтвета, Задание);
		Закрыть();
	КонецЕсли;  

		
КонецПроцедуры 

&НаКлиенте
Процедура Обновление() Экспорт
	
	ЧатHTMLОбновить();

КонецПроцедуры

&НаСервере
Процедура СообщениеВОбсуждение()
	
//	Если ТипЗнч(Задание) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
//		УчастникиДиалога = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задание, "Аналитик,Исполнитель");
//		Аналитик = УчастникиДиалога.Аналитик;
//		Исполнитель = УчастникиДиалога.Исполнитель;
//	Иначе
//		Аналитик  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задание, "Постановщик");
//		Исполнитель = ЦБР_ОбсужденияСервер.ПоследнийЗаявительПоПолучателю(Задание, Аналитик);
//		Если Исполнитель = Неопределено Тогда
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;
//	Получатели = Новый Массив;
//	Если Заявитель = Аналитик Тогда
//		Получатели.Добавить(Исполнитель);
//		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Задание, "ОтветНаЗапрос", Получатели, Комментарий);
//	Иначе
//		Получатели.Добавить(Аналитик);
//		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Задание, "ЗапросИнформации", Получатели, Комментарий);
//	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЧатHTMLОбновить()

	СтрокаHTML = "<html><head>
				 |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
				 |<link rel=""stylesheet"" type=""text/css"" href=""__STYLE__"">
				 |<base href=""v8config://498ce97d-6689-44e1-a350-7d98de25218c/mdobject/ide9d656c7-f54e-4712-839e-fd471433190e/8eb4fad1-1fa6-403e-970f-2c12dbb43e23"">
				 |<style>
				 | *{
				 |    box-sizing:border-box;
				 | }
				 |body{
				 |    background-color: #ffffff;
				 |    font-family:Arial;
				 |}
				 | #container{
				 |     background:#ffffff;
				 |     margin:0 auto;
				 |     font-size:0;
				 |     border-radius:5px;
				 |     overflow:hidden;
				 | }
				 |main{
				 |     font-size:15px;
				 |     vertical-align:top;
				 |     max-width:10000px;
				 | }
				 | h2,h3{
				 |     margin:0;
				 | }
				 | .status{
				 |    width:8px;
				 |   height:8px;
				 |  border-radius:50%;
				 | display:inline-block;
				 |margin-right:7px;
				 |}
				 | .green{
				 |     background-color:#58b666;
				 | }
				 | .blue{
				 |     background-color: #a2aeb6;
				 |     margin-right:0;
				 |     margin-left:7px;
				 | }
				 | #chat{
				 |     padding-left:0;
				 |     margin:0;
				 |     list-style-type:none;
				 |     border-top:2px solid #fff;
				 |     border-bottom:2px solid #fff;
				 | }
				 | #chat li{
				 |      padding:10px 30px;
				 | }
				 | #chat h2,#chat h3{
				 |     display:inline-block;
				 |     font-size:13px;
				 |     font-weight:normal;
				 | }
				 | #chat h3{
				 |      color: #3d3d3d;
				 |      padding:0px 5px;
				 |  }
				 |  #chat .entete{
				 |      padding:10px;
				 |      margin-bottom:5px;
				 | }
				 |  #chat .day{
				 |      text-align:center;
				 |  }
				 |  #chat .message{
				 |      padding:10px;
				 |      color:#fff;
				 |      line-height:15px;
				 |      max-width:70%;
				 |      word-wrap:break-word;
				 |      display:inline-block;
				 |      text-align:left;
				 |      border-radius:15px;
				 |  }
				 |  #chat .me{
				 |      text-align:right;
				 |  }
				 |  #chat .you .message{
				 |      background-color:#6fbced;
				 |  }
				 |  #chat .me .message{
				 |      background-color:#58b666;
				 |  }
				 |  #chat .day .message{
				 |      background-color: #484545;
				 | }
				 |</style>				
				 |</head>
				 |<body><div id=""container""><main><ul id=""chat"">";

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦБР_УточненияПоЗаданиям.Период КАК Период,
	|	ЦБР_УточненияПоЗаданиям.Заявитель КАК Заявитель,
	|	ЦБР_УточненияПоЗаданиям.Ответчик КАК Ответчик,
	|	ЦБР_УточненияПоЗаданиям.ТекстЗапроса КАК ТекстЗапроса,
	|	ЦБР_УточненияПоЗаданиям.ТекстОтвета,
	|	ЦБР_УточненияПоЗаданиям.Отменено,
	|	ЦБР_УточненияПоЗаданиям.ДатаОтветаНаЗапрос,
	|	ЦБР_УточненияПоЗаданиям.ДатаОтветаНаЗапросФакт
	|ИЗ
	|	РегистрСведений.ЦБР_УточненияПоЗадачамЗаданиям КАК ЦБР_УточненияПоЗаданиям
	|ГДЕ
	|	ЦБР_УточненияПоЗаданиям.Задание = &Задание
	|	И НЕ ЦБР_УточненияПоЗаданиям.Отменено
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";

	Запрос.УстановитьПараметр("Задание", Задание);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	ДатаСообщений = Дата(1, 1, 1);

	Пока Выборка.Следующий() Цикл    
		
		//Дата
		Если НачалоДня(Выборка.Период) <> ДатаСообщений Тогда
			ДатаСообщений = НачалоДня(Выборка.Период);
			СтрокаHTML = СтрокаHTML + "<li class=""day""><div class=""message"">" + Формат(ДатаСообщений, "ДЛФ=DD")
				+ "</div></li>";
		КонецЕсли;

		//Сообщение
		
		Если Пользователи.ТекущийПользователь() = Выборка.Заявитель Тогда			
			СтрокаHTML = СтрокаHTML + "<li class=""me""><div class=""entete"">";
			СтрокаHTML = СтрокаHTML + "<h3>" + Формат(Выборка.Период, "ДФ=HH:mm") + "</h3><h2>Я</h2>";
			СтрокаHTML = СтрокаHTML + "</div><div class=""message"">" + СтрЗаменить(Выборка.ТекстЗапроса, Символы.ПС, "<br>") + "</div></li>";
		
			Если Выборка.ТекстОтвета <> "" Тогда
				СтрокаHTML = СтрокаHTML + "<li class=""you""><div class=""entete"">";
				СтрокаHTML = СтрокаHTML + "<h3>" + Формат(Выборка.Период, "ДФ=HH:mm") + "</h3><h2>" + Выборка.Ответчик
					+ "</h2>";
				СтрокаHTML = СтрокаHTML + "</div><div class=""message"">" + СтрЗаменить(Выборка.ТекстОтвета,
					Символы.ПС, "<br>") + "</div></li>";
			КонецЕсли;
		ИначеЕсли Пользователи.ТекущийПользователь() = Выборка.Ответчик Тогда
			СтрокаHTML = СтрокаHTML + "<li class=""you""><div class=""entete"">";
			СтрокаHTML = СтрокаHTML + "<h3>" + Формат(Выборка.Период, "ДФ=HH:mm") + "</h3><h2>"+Выборка.Заявитель+"</h2>";
			СтрокаHTML = СтрокаHTML + "</div><div class=""message"">" + СтрЗаменить(Выборка.ТекстЗапроса, Символы.ПС, "<br>") + "</div></li>";	
			Если Выборка.ТекстОтвета <> "" Тогда
				СтрокаHTML = СтрокаHTML + "<li class=""me""><div class=""entete"">";
				СтрокаHTML = СтрокаHTML + "<h3>" + Формат(Выборка.ДатаОтветаНаЗапросФакт, "ДФ=HH:mm") + "</h3><h2>Я</h2>";
				СтрокаHTML = СтрокаHTML + "</div><div class=""message"">" + СтрЗаменить(Выборка.ТекстОтвета,
					Символы.ПС, "<br>") + "</div></li>";
			КонецЕсли;		
		Иначе
			СтрокаHTML = СтрокаHTML + "<li class=""me""><div class=""entete"">";
			СтрокаHTML = СтрокаHTML + "<h3>" + Формат(Выборка.Период, "ДФ=HH:mm") + "</h3><h2>"+Выборка.Заявитель+"</h2>";
			СтрокаHTML = СтрокаHTML + "</div><div class=""message"">" + СтрЗаменить(Выборка.ТекстЗапроса, Символы.ПС, "<br>") + "</div></li>";
			Если Выборка.ТекстОтвета <> "" Тогда
				СтрокаHTML = СтрокаHTML + "<li class=""you""><div class=""entete"">";
				СтрокаHTML = СтрокаHTML + "<h3>" + Формат(Выборка.ДатаОтветаНаЗапросФакт, "ДФ=HH:mm") + "</h3><h2>" + Выборка.Ответчик
					+ "</h2>";
				СтрокаHTML = СтрокаHTML + "</div><div class=""message"">" + СтрЗаменить(Выборка.ТекстОтвета,
					Символы.ПС, "<br>") + "</div></li>";
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	Если Выборка.Ответчик = Пользователи.ТекущийПользователь() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСообщение", "Видимость", Не ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапросФакт));
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапрос) И Не ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапросФакт) Тогда 
		ДатаОтветаНаЗапрос = Формат(Выборка.ДатаОтветаНаЗапрос, "ДЛФ=DD;");
	Иначе
		ДатаОтветаНаЗапрос = "";
	КонецЕсли;   
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаОтветаНаЗапросСтрока", "Видимость", ЗначениеЗаполнено(ДатаОтветаНаЗапрос));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаОтветаНаЗапрос", "Видимость", Выборка.Ответчик = Пользователи.ТекущийПользователь()  И Не ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапрос) И Не ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапросФакт));

	Если Элементы.Отменить.Видимость И ЗначениеЗаполнено(Выборка.ДатаОтветаНаЗапросФакт) Тогда
		Элементы.Отменить.Видимость = Ложь;
	КонецЕсли;
	
	СтрокаHTML = СтрокаHTML + "</ul></main></div></body></html>";
	ЧатHTML = СтрокаHTML;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Заявитель,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Ответчик,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.Отменено,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.ТекстЗапроса,
	|	ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних.ТекстОтвета
	|ИЗ
	|	РегистрСведений.ЦБР_УточненияПоЗадачамЗаданиям.СрезПоследних(, Задание = &Задание) КАК
	|		ЦБР_УточненияПоЗадачамЗаданиямСрезПоследних";

	Запрос.УстановитьПараметр("Задание", Задание);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если Выборка.Отменено ИЛИ  Выборка.ТекстОтвета <> "" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Отменить", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаОтветаНаЗапрос", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСообщение", "Видимость", Ложь);							
	Иначе
		Если Пользователи.ТекущийПользователь() <> Выборка.Ответчик Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Отменить", "Видимость", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаОтветаНаЗапрос", "Видимость",Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСообщение", "Видимость", Ложь);	
		Иначе
			Заявитель = Выборка.Заявитель;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Отменить", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаОтветаНаЗапрос", "Видимость",Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСообщение", "Видимость", Истина);	
		КонецЕсли;
	КонецЕсли;


КонецПроцедуры

#КонецОбласти
